Repository: rissajeanne/lucene
Catalog: locale/*/locale.po
Languages: ar_iq, da_dk, ru_ru, uk_ua

# plugins.generic.lucene.settings.indexAdministration
source: Index Administration
da_dk: Indeksadministration
ru_ru: Администрирование индекса
uk_ua: Адміністрування індексу

# plugins.generic.lucene.settings.indexRebuild
source: Rebuild index
da_dk: Genopbyg indeks
ru_ru: Перестроить индекс
uk_ua: Перебудувати індекс

# plugins.generic.lucene.settings.indexRebuild.confirm
source: Rebuilding the index and/or dictionaries can take a long time. Are you sure you want to proceed?
da_dk: Genopbygning af indekset og/eller ordbøgerne kan tage lang tid. Er du sikker på, at du vil fortsætte?
ru_ru: Перестройка индекса и/или словарей может занять длительное время. Вы уверены, что хотите продолжить?
uk_ua: Перебудова індексу та/або словників може тривати багато часу. Ви впевнені, що хочете продовжити?

# plugins.generic.lucene.settings.indexRebuildAllJournals
source: Rebuild index for all journals
da_dk: Genopbyg indeks til alle tidsskrifter
ru_ru: Перестроить индекс для всех журналов
uk_ua: Перебудувати індекс для усіх журналів

# plugins.generic.lucene.settings.indexRebuildDescription
source: If your Lucene index became outdated or corrupted, you can re-index your data per journal or for all journals of this installation. Dictionaries must be rebuilt after large index updates when using auto-suggest or alternative spelling suggestions. (See plugins/generic/lucene/README for details and ways to automate these processes.)
da_dk: Hvis dit Lucene-indeks blev forældet eller ødelagt, kan du genindeksere dine data for hvert enkelt tidsskrift eller for samtlige tidsskrifter på denne installation. Ordbøger skal, når du bruger automatisk forslag eller alternative staveforslag, genopbygges efter store indeksopdateringer. (Se plugins/generic/lucene/README for detaljer og måder at automatisere disse processer på.)
ru_ru: Если ваш индекс Lucene оказался устаревшим или поврежденным, Вы можете переиндексиовать данные для журнала или для всех журналов этой инсталляции. Словари должны быть перестроены после больших обновлений индекса, если используется автоподстановка или предложения альтернативного написания. (Смотрите plugins/generic/lucene/README о подробностях и путях автоматизации этих процессов.)
uk_ua: Якщо ваш індекс Lucene виявився застарілим або ушкодженим, ви можете переіндексувати дані для журналу або для всіх журналів цієї інсталяції. Словники повинні бути перебудовані після значних оновлень індексу, якщо використовується автопідстановка або пропозиції альтернативних варіантів написання. (Дивись plugins/generic/lucene/README про подробиці та шляхи автоматизації цих процесів.)

# plugins.generic.lucene.settings.indexRebuildJournal
source: Rebuild index for journal "{$journalName}"
da_dk: Genopbyg indeks til tidsskrift "{$journalName}"
ru_ru: Перестроить индекс для журнала «{$journalName}»
uk_ua: Перебудувати індекс для журналу "{$journalName}"

# plugins.generic.lucene.settings.indexRebuildMessages
source: Output from the last index rebuild:
da_dk: Output fra den sidste genopbygning af indeks:
ru_ru: Результаты последнего перестраивания индекса:
uk_ua: Результати останньої перебудови індексу:

# plugins.generic.lucene.settings.instantSearch
source: Instant search (return search results instantly when a user types a search query - obs: uses considerable server resources)
da_dk: Lynsøgning (returnerer søgeresultater øjeblikkeligt, når en bruger skriver en søgeforespørgsel - OBS: bruger betydelige serverressourcer)
ru_ru: Мгновенный поиск (сразу возвращает результаты поиска, когда пользователь вводит поисковый запрос - особенность: использует значительные ресурсы сервера)
uk_ua: Миттєвий пошук (одразу повертає результати пошуку, коли користувач вводить пошуковий запит - особливість: використовує значні серверні ресурси)

# plugins.generic.lucene.settings.instId
source: Unique Installation ID
ar_iq: رمز التنصيب الفريد
da_dk: Unikt Installations-ID
ru_ru: Уникальный ID инсталляции
uk_ua: Унікальний ідентифікатор інсталяції

# plugins.generic.lucene.settings.instIdRequired
source: Please enter an ID that uniquely identifies this OJS installation to the Solr search server.
ar_iq: لطفاً، أدخل الرمز التعريفي الفريد الذي يخص هذا التنصيب من نظام المجلات المفتوحة ليتم التعامل به مع ملقم بحث المؤسسة.
da_dk: Indtast et ID, der unikt identificerer denne OJS-installation i forhold til Solr-søgeserveren.
ru_ru: Пожалуйста, введите ID, который уникальным образом идентифицирует эту инсталляцию OJS для поискового сервера Solr.
uk_ua: Будь ласка, вкажіть ID, який буде унікально ідентифікувати це впровадження OJS на пошуковому сервері solr.

# plugins.generic.lucene.settings.instIdInstructions
source: If you use a central search server then you'll have to provide a unique installation ID for every OJS installation sharing the same search index. This can be any arbitrary text but it must be different for every participating OJS server (e.g. the server's static IP address if you have one OJS installation per server).
ar_iq: إن استعملت ملقم بحث مركزي، عندها عليك تقديم معرف تنصيب فريد لكل تنصيب من نظام المجلات المفتوحة لأنها ستتشارك في فهرس بحث واحد. ذلك سيكون أي نص عشوائي، غير أنه ينبغي أن لا يتكرر مع التنصيبات الأخرى المشاركة لملقم البحث (مثل: عنوان الملقم الثابت IP إن كان لديك تنصيب واحد من النظام لكل ملقم).
da_dk: Hvis du bruger en central søge-server, skal du sørge for, at der er et unikt installations-id for hver OJS-installation, der deler det samme søgeindeks. Dette kan være en vilkårlig tekst, men den skal være forskellig for hver involveret OJS-server (f.eks. serverens statiske IP-adresse, hvis du har en OJS-installation pr. server).
ru_ru: Если вы используете централизованный поисковый сервер, то вам необходимо будет задать уникальный ID инсталляции для каждой из инсталляций OJS, использующих одинаковый поисковый индекс. Это может быть любой произвольный текст, но он должен быть разным для каждого из участвующих серверов OJS (например, статический IP-адрес сервера, если у вас на каждом сервере установлена одна инсталляция OJS).
uk_ua: Якщо Ви використовуєте централізований пошуковий сервер, тоді необхідно вказати унікальні ID для кожної інсталяції OJS, які використовують однаковий пошуковий пошуковий індекс. Це може бути довільний текст, але він має бути унікальним для кожного залученого серверу OJS (наприклад, це можуть бути статичні IP-адреси, якщо кожна інсталяція OJS розміщена на окремому сервері).

# plugins.generic.lucene.settings.internalError
source: Invalid selection.
ar_iq: إختيار خاطئ.
da_dk: Ugyldigt valg.
ru_ru: Неправильный выбор.
uk_ua: Неправильний вибір.

# plugins.generic.lucene.settings.luceneSettings
source: Lucene Plugin: Settings
ar_iq: إضافة Lucene: الإعدادات
da_dk: Lucene Plugin: Indstillinger
ru_ru: Модуль «Lucene»: Настройки
uk_ua: Модуль Lucene: Налаштування серверу Solr

# plugins.generic.lucene.settings.passwordInstructions
source: Please enter the Solr server password.
ar_iq: لطفاً، أدخل كلمة المرور لملقم المؤسسة.
da_dk: Indtast password til Solr-serveren.
ru_ru: Пожалуйста, введите пароль сервера Solr.
uk_ua: Будь ласка, вкажіть пароль для серверу solr.

# plugins.generic.lucene.settings.passwordRequired
source: Please enter a valid password to authenticate to the Solr search server.
ar_iq: لطفاً، أدخل كلمةالمرور الصحيحة للحصول على مصادقة ملقم بحث المؤسسة.
da_dk: Indtast et gyldigt password for at få adgang til Solr-søgeserveren.
ru_ru: Пожалуйста, введите правильный пароль для аутентификации сервера поиска Solr.
uk_ua: Будь ласка, вкажіть коректний пароль для аутентифікації на пошуковому сервері solr.

# plugins.generic.lucene.settings.pullIndexing
source: Pull indexing (this is an advanced feature, see README file for more information)
ar_iq: سحب الفهرسة (هذه ميزة متقدمة، أنظر ملف README للمزيد من المعلومات)
da_dk: Pull-indeksering (dette er en avanceret funktion, se README-filen for mere information)
ru_ru: Самостоятельная индексация сервером (pull indexing — это расширенная возможность, более подробную информацию можно найти в файле README)
uk_ua: Самостійна індексація сервером (pulll indexing - це додаткова функція, дивіться файл README для отримання додаткової інформації)

# plugins.generic.lucene.settings.rankingByMetricEnabled
source: Ranking By Usage Statistics (Your '{$metricName}' statistics data will be used to influence the ranking)
da_dk: Rangering efter brugsstatistik (dine '{$metricName}' statistiske data vil blive brugt til at påvirke rangordningen)
ru_ru: Ранжировать по статистике использования (Статистические данные метрики «{$metricName}» будут влиять на ранжирование результатов)
uk_ua: Ранжувати за статистикою використання (Дані вашої статистики '{$metricName}' впливатимуть на ранжування результатів)

# plugins.generic.lucene.settings.rankingByMetricDisabled
source: Ranking By Usage Statistics (please activate at least one statistics/reporting plugin and select a "main metric" in the site settings to enable this option)
da_dk: Rangering efter brugsstatistik (aktivér mindst én statistik-/rapporterings-plugin og vælg en "main metric" i webstedets indstillinger for at aktivere denne mulighed)
ru_ru: Ранжировать по статистике использования (пожалуйста, активируйте по крайней мере один модуль статистики/отчетов и выберите «главную метрику» в настройках сайта, чтобы включить этот параметр)
uk_ua: Ранжувати за статистикою використання (будь ласка, активуйте хоча б один модуль статистики/звітів і оберіть "головну метрику" в налаштуваннях сайту, щоб увімкнути цей параметр)

# plugins.generic.lucene.settings.searchEndpoint
source: Search Endpoint URL
ar_iq: رابط الأجهزة الطرفية للبحث
da_dk: Søgepunkts-URL
ru_ru: URL-адрес конечной точки поиска
uk_ua: URL кінцевої точки пошуку

# plugins.generic.lucene.settings.searchEndpointInstructions
source: The Solr search endpoint consists of the server URL and a search handler. See the default setting as an example. Only change this if you are using a central search server.
ar_iq: إن رابط الإنترنت لملقم المؤسسة يضم رابط إنترنت الملقم ومعالج البحث. أنظر الإعدادات الإفتراضية كمثال. غيره فقط إذا كنت تستعمل ملقم بحث مركزي.
da_dk: Solr-søgepunktet består af serverens URL og en søgeagent (’handler’). Se standardindstillingen som et eksempel på dette. Du skal kun ændre dette, hvis du bruger en central søge-server.
ru_ru: Конечная точка поиска Solr состоит из URL-адреса сервера и обработчика поиска. В качестве примера воспользуйтесь настройкой по умолчанию. Измените ее только в случае использования централизованного поискового сервера.
uk_ua: Кінцева точка пошуку Solr складається з URL-адреси серверу та пошукового обробника. Як приклад, див. налаштування за замовчуванням. Ці налаштування потрібно змінювати лише у випадку, якщо Ви налаштовуєте централізований пошуковий сервер.

# plugins.generic.lucene.settings.searchEndpointRequired
source: Please enter a valid URL representing the search endpoint (Solr search server and search handler) you would like to connect to.
ar_iq: لطفاً، أدخل رابط إنترنت صحيح يمثل الأجهزة الطرفية للبحث (ملقم بحث المؤسسة ومعالج البحث) التي تريد الارتباط معها.
da_dk: Indtast en gyldig URL, der repræsenterer det søgepunkt (Solr søge-server og søgeagent (handler)), du gerne vil oprette forbindelse til.
ru_ru: Пожалуйста, введите правильный URL-адрес, представляющий конечную точку поиска (поисковый сервер Solr и обработчик поиска), к которой вы хотите подключиться.
uk_ua: Будь ласка, вкажіть коректну адресу URL для кінцевої точки пошуку (пошуковий сервер solr та пошуковий обробник), з якою Ви хочете з'єднатися.

# plugins.generic.lucene.settings.searchFeatures
source: Search Feature Configuration
ar_iq: إعدادات ميزات البحث
da_dk: Søgefunktions-konfiguration
ru_ru: Настройка возможностей поиска
uk_ua: Налаштування можливостей пошуку

# plugins.generic.lucene.settings.serverNotAvailable
source: You can not currently administer the Solr server from the web interface.<br/> <br/> Possible reasons are: <ul> <li>You may not have an embedded server installed in this OJS instance (see 'plugins/generic/lucene/README' for details).</li> <li>The installation of your embedded server may be incomplete. Please check that the directories 'plugins/generic/lucene/lib/solr' and 'plugins/generic/lucene/lib/jetty' actually contain (or point to) the solr/jetty installation files.</li> <li>The server administration scripts 'start.sh', 'stop.sh' and 'check.sh' in 'plugins/generic/lucene/embedded/bin' may not be executable. Check the permission flags of these files. {$canExecuteResult}</li> <li>The files in 'files/lucene/' may not be writable by your web server's user. Check the permission flags of these files. {$filesAreWriteableResult}</li> <li>An embedded solr process may already be running but under a different OS user. This means that you cannot manipulate the process from within PHP. {$solrIsRunningUnderPHPUser}</li> <li>Your PHP configuration may disallow script execution. Check the 'safe_mode' and 'disabled_function' settings in your php.ini. If you do not have access to your php.ini then you can execute the scripts manually to start/stop the server. {$safemodeOrExecDisabled}</li> </ul>
da_dk: Du kan ikke administrere Solr-serveren fra webgrænsefladen i øjeblikket.<br/> <br/> Mulige årsager kan være: <ul> <li>Du har muligvis ikke en integreret server installeret i dette OJS-tilfælde (se 'plugins/generic/lucene/README' for detaljer).</li> <li>Installationen af din integrerede server kan være ufuldstændig. Kontrollér, at katalogerne 'plugins/generic/lucene/lib/solr' og 'plugins/generic/lucene/ ib/jetty' faktisk indeholder (eller peger på) installationsfilerne til solr/pier.</li> <li>Følgende serveradministrations-scripts, 'start.sh', 'stop.sh' og 'check.sh' i 'plugins/generic/lucene/embedded/bin' er muligvis ikke eksekverbare. Kontrollér adgangsmærkerne for disse filer.</li> <li>Filerne i 'files/lucene/' er muligvis ikke skrivbare for din webservers bruger. Kontrollér adgangsmærkerne for disse filer.</li> <li>En integreret solr-proces kører måske allerede, men under en anden OJS-bruger. Det betyder, at du ikke kan tilrette processen fra PHP.</li> <li>Din PHP-konfiguration tillader muligvis ikke scriptudførelse. Kontrollér indstillingerne 'safe_mode' og 'disabled_function' i din php.ini. Hvis du ikke har adgang til din php.ini, kan du effektuere scriptene manuelt for at starte/stoppe serveren.</li> </ul>
ru_ru: Сейчас вы не можете администрировать сервер Solr через веб-интерфейс.<br/> <br/> Возможные причины: <ul> <li>У вас может быть не установлен встроенный сервер в эту инсталляцию OJS (подробности смотрите в «plugins/generic/lucene/README»).</li> <li>Установка вашего встроенного сервера может быть неполной. Пожалуйста проверьте, что каталоги «plugins/generic/lucene/lib/solr» и «plugins/generic/lucene/lib/jetty» действительно содержат (или указывают) на файлы установки solr/jetty.</li> <li>Скрипты администрирования сервера «start.sh», «stop.sh» и «check.sh» в «plugins/generic/lucene/embedded/bin» могут не иметь прав на выполнение. Проверьте установку разрешений для этих файлов. {$canExecuteResult}</li> <li>Файлы в «files/lucene/» могут быть не доступны для записи пользователю вашего веб-сервера. Проверьте установку разрешений для этих файлов. {$filesAreWriteableResult}</li> <li>Встроенный процесс solr может быть уже запущен, но под другим пользователем операционной системы. Это означает, что вы не можете управлять процессом из PHP. {$solrIsRunningUnderPHPUser}</li> <li>Ваша конфигурация PHP может запрещать выполнение скриптов. Проверьте настройки «safe_mode» и «disabled_function» в вашем php.ini. Если у вас нет доступа к вашему php.ini, то вы можете вручную выполнять скрипты для запуска/остановки сервера. {$safemodeOrExecDisabled}</li> </ul>
uk_ua: Зараз ви не можете керувати сервером Solr через веб-інтерфейс.<br/> <br/> Можливі причини: <ul> <li>У вас може бути не встановлений вбудований сервер у цій інсталяції OJS (докладніше дивись у 'plugins/generic/lucene/README').</li> <li>Встановлення вашого вбудованого сервера може бути неповним. Будь ласка, перевірте, чи каталоги 'plugins/generic/lucene/lib/solr' та 'plugins/generic/lucene/lib/jetty' дійсно містять (або вказують) на файли встановлення solr/jetty.</li> <li>Скрипти адміністрування сервера 'start.sh', 'stop.sh' і 'check.sh' в 'plugins/generic/lucene/embedded/bin' можуть не мати прав на виконання. Перевірте встановлення повноважень для цих файлів. {$canExecuteResult}</li> <li>Файли в 'files/lucene/' можуть бути не доступні для запису користувачу на вашому веб-сервері . Перевірте встановлення повноважень для цих файлів. {$filesAreWriteableResult}</li> <li>Вбудований процес Solr може вже працювати, але під іншим користувачем ОС. Це означає, що ви не можете керувати процесом з PHP. {$solrIsRunningUnderPHPUser}</li> <li>Ваша конфігурація PHP може забороняти виконання скриптів. Перевірте налаштування 'safe_mode' та 'disabled_function' у вашому php.ini. Якщо у вас немає прав доступу до вашого php.ini ви можете виконувати скрипти вручну, щоб запускати/зупиняти сервер. {$safemodeOrExecDisabled}</li> </ul>

# plugins.generic.lucene.settings.simdocs
source: More-Like-This (display a link "similar documents" for every search result)
ar_iq: المزيد من ذلك (إعرض رابط "وثائق مشابهة" لكل نتيجة بحث)
da_dk: ’Mere af samme slags’ (vis et link "lignende dokumenter" for hvert søgeresultat)
ru_ru: «Еще похожих» (показывать ссылку «похожие документы» для каждого результата поиска)
uk_ua: "Ще таких" (відображає посилання "схожі документи" для кожного результату пошуку)

# plugins.generic.lucene.settings.solrServerSettings
source: Solr server settings
ar_iq: إعدادات ملقم المؤسسة
da_dk: Solr-serverindstillinger
ru_ru: Настройки сервера Solr
uk_ua: Налаштування серверу Solr

# plugins.generic.lucene.settings.sortingByMetricEnabled
source: Sorting By Usage Statistics (Your '{$metricName}' statistics data will be used to sort by popularity)
da_dk: Sortering efter brugsstatistik (dine '{$metricName}' statistiske data vil blive brugt til at sortere efter popularitet)
ru_ru: Сортировать по статистике использования (Статистические данные метрики «{$metricName}» будут использоваться для сортировки по популярности)
uk_ua: Сортувати за статистикою використання (Дані статистики '{$metricName}' будуть використовуватися для сортування за популярністю)

# plugins.generic.lucene.settings.sortingByMetricDisabled
source: Sorting By Usage Statistics (please activate at least one statistics/reporting plugin and select a "main metric" in the site settings to enable this option)
da_dk: Sortering efter brugsstatistik (aktivér mindst én statistik-/rapporterings-plugin og vælg en "main metric" i webstedsindstillingerne for at aktivere denne indstilling)
ru_ru: Сортировать по статистике использования (пожалуйста, активируйте по крайней мере один модуль статистики/отчетов и выберите «главную метрику» в настройках сайта, чтобы включить этот параметр)
uk_ua: Сортувати за статистикою використання (будь ласка активуйте хоча б один модуль статистики/звітів і оберіть "головну метрику" в налаштуваннях сайту, щоб увімкнути цей параметр)

# plugins.generic.lucene.settings.spellcheck
source: Alternative Spelling Suggestions (display alternative search terms)
ar_iq: مقترحات التهجئة البديلة (إعرض عبارات بحث بديلة)
da_dk: Alternative staveforslag (vis alternative søgeord)
ru_ru: Предложения альтернативного написания (показывать альтернативные поисковые термины)
uk_ua: Альтернативні варіанти правопису (відображати альтернативні пошукові слова)

# plugins.generic.lucene.settings.updateBoostFile
source: Update Ranking Data
da_dk: Opdatér rangerings-data
ru_ru: Обновить данные ранжирования
uk_ua: Оновити дані ранжування

# plugins.generic.lucene.settings.updateBoostFileDescription
source: Usage statistics must be copied regularly to the Solr server, e.g. daily or monthly - depending on how often you update the statistics. To do so click the button above. You can also automate this task (see 'plugins/generic/lucene/README' for details).
da_dk: Brugerstatistik skal kopieres regelmæssigt til Solr-serveren, f.eks. dagligt eller månedligt - afhængigt af hvor ofte du opdaterer statistikken. Det gør du ved at klikke på knappen ovenfor. Du kan også automatisere denne opgave (se 'plugins/generic/lucene/README' for detaljer).
ru_ru: Статистика использования должна регулярно копироваться на сервер Solr, например ежедневно или ежемесячно в зависимости от того, как часто вы обновляете статистику. Для этого щелкните на кнопке выше. Вы можете автоматизировать эту задачу (подробности смотрите в «plugins/generic/lucene/README»).
uk_ua: Статистика використання повинна регулярно копіюватися на сервер Solr, наприклад, щодня або щомісяця, залежно від того, як часто ви оновлюєте статистику. Для цього натисніть кнопку вище. Ви також можете автоматизувати це завдання (докладніше дивись у 'plugins/generic/lucene/README').

# plugins.generic.lucene.settings.updateBoostFileDisabled
source: Usage statistics must be copied regularly to the Solr server. You can not currently update usage statistics from the web interface.<br/> <br/> Possible reasons are: <ul> <li>If you are using pull indexing, the index update cron job on the remote server ("pull.sh") will automatically update statistics data whenever executed (see 'plugins/generic/lucene/README' for details).</li> <li>Your web server may not have write permissions to the 'files/lucene/data' directory. Make sure that both, the web server and the solr server, have access to this directory and refresh this page.</li> </ul>
da_dk: Brugerstatistik skal kopieres regelmæssigt til Solr-serveren. Du kan i øjeblikket ikke opdatere brugsstatistik fra webgrænsefladen.<br/> <br/> Mulige årsager kan være: <ul> <li>Hvis du bruger pull-indeksering, vil indeksopdaterings-cron-jobbet på den eksterne server ("pull.sh") automatisk opdatere statistiske data, når de udføres (se 'plugins/generic/lucene/README' for detaljer).</li> <li>Din webserver har muligvis ikke skrivetilladelser til mappen 'filer/lucene/data'. Sørg for, at både webserveren og solr-serveren har adgang til denne mappe og opdatér denne side.</li> </ul>
ru_ru: Статистика использования должна регулярно копироваться на сервер Solr. Сейчас вы не можете обновить статистику использования через веб-интерфейс.<br/> <br/> Возможные причины: <ul> <li>Если вы используете самостоятельную индексацию сервером (pull indexing) задача cron по обновлению индекса на удаленном сервере («pull.sh») будет автоматически обновлять статистические данные при каждом запуске (подробности смотрите в «plugins/generic/lucene/README»).</li> <li>У вашего сервера нет прав на запись в каталог «files/lucene/data». Убедитесь, что и веб-сервер, и сервер solr имеют доступ к этому каталогу и обновите эту страницу.</li> </ul>
uk_ua: Статистика використання має регулярно копіюватися на сервер Solr. Зараз неможливо оновити статистику використання через веб-інтерфейс.<br/> <br/> Можливі причини: <ul> <li>Якщо ви використовуєте самостійне індексування сервером (pull indexing), завдання cron для оновлення індексу на віддаленому сервері ("pull.sh") автоматично оновлюватиме дані статистики при кожному виконанні (докладніше дивись у 'plugins/generic/lucene/README').</li> <li>Ваш веб-сервер може не мати повноважень на запис у каталог 'files/lucene/data'. Переконайтеся, що і веб-сервер, і сервер solr, мають доступ до цього каталогу та оновіть цю сторінку.</li> </ul>

# plugins.generic.lucene.settings.usageStatistics
source: Usage Statistics
da_dk: Brugsstatistik
ru_ru: Статистика использования
uk_ua: Статистика використання

# plugins.generic.lucene.settings.useProxySettings
source: Proxy settings
da_dk: Proxy-indstillinger
ru_ru: Настройки прокси-сервера
uk_ua: Налаштування проксі-сервера
