Repository: rissajeanne/lucene
Catalog: locale/*/locale.po
Languages: ar_iq, da_dk, ru_ru, uk_ua

# plugins.generic.lucene.settings.useProxySettingsInstructions
source: Use proxy settings from the file config.inc.php for the Solr web service requests.
da_dk: Brug proxy-indstillinger fra filen config.inc.php til Solr webservice-anmodninger.
ru_ru: Использовать настройки прокси-сервера из файла config.inc.php для запросов веб-службы Solr.
uk_ua: Використовувати налаштування проксі-сервера з файлу config.inc.php для запитів веб-служби Solr.

# plugins.generic.lucene.settings.username
source: Username
ar_iq: اسم المستخدم
da_dk: Brugernavn
ru_ru: Имя пользователя
uk_ua: Ім'я користувача

# plugins.generic.lucene.settings.usernameInstructions
source: The Solr search server uses HTTP BASIC authentication. Please enter the username.
ar_iq: إن ملقم بحث المؤسسة يستعمل المصادقة الأساسية لـ HTTP. لطفاً، أدخل اسم المستخدم.
da_dk: Solr-søgeserveren bruger HTTP BASIC-godkendelse. Indtast brugernavnet.
ru_ru: Поисковый сервер Solr использует аутентификацию HTTP BASIC. Пожалуйста, введите имя пользователя.
uk_ua: Пошуковий сервер Solr використовує аутентифікацію HTTP BASIC. Будь ласка, вкажіть ім'я користувача.

# plugins.generic.lucene.settings.usernameRequired
source: Please enter a valid username to authenticate to the Solr search server (colons are disallowed).
ar_iq: لطفاً، أدخل اسم صحيحاً للمستخدم للحصول على مصادقة ملقم بحث المؤسسة (علامات الترقيم ممنوعة هنا).
da_dk: Indtast et gyldigt brugernavn for at få godkendt adgang til Solr-søgeserveren (kolonner er ikke tilladt).
ru_ru: Пожалуйста, введите правильное имя пользователя для аутентификации поискового сервера Solr (двоеточия запрещены).
uk_ua: Будь ласка, вкажіть коректне ім'я користувача для аутентифікації на пошуковому сервері solr (двокрапки заборонені).

# plugins.generic.lucene.sectionForm.rankingBoost
source: Custom Ranking Weight
ar_iq: وزن التقييم المخصص
da_dk: Brugerdefineret rangeringsvægtning
ru_ru: Пользовательский вес ранжирования
uk_ua: Власна вага ранжування

# plugins.generic.lucene.sectionForm.rankingBoostInstructions
source: The Lucene/Solr search plugin allows you to adjust the relative weight of articles in the result list of a search query. Setting the ranking weight higher (or lower) does not place articles in this section above (or below) all other articles. But they will rank better (or worse) than they would without the adjustment made. Setting this option to "never show" will completely exclude articles in this section from search results.
ar_iq: إن إضافة بحث Lucene تتيح لك تعديل أوزان ظهور المقالات في نتائج البحث للاستعلام التي يدخلها المستخدمون. ضبط وزن التقييم على درجة أعلى (أو أقل) لا يضع المقالة التي في هذا القسم أعلى (أو أسفل) المقالات الأخرى، لكنها ستقيم أفضل (أو أسوأ) مما ستحصل عليه من تقييم دون إجراء ذلك التعديل. ضبط هذا الخيار على "لا ترني أبداً" سيستثني كلياً مقالات هذا القسم من نتائج البحث.
da_dk: Lucene/Solr-søge plugin’en gør det muligt at justere den relative vægtning af artikler i resultatlisten af en søgeforespørgsel. En højere (eller lavere) placeringsvægtning sætter ikke artikler i dette afsnit ovenfor (eller nedenfor) alle andre artikler. Men de vil rangere bedre (eller værre) end de ellers ville uden den foretagne justering. Ved at vælge muligheden "vis aldrig" udelukkes artikler helt i dette afsnit fra søgeresultater.
ru_ru: Модуль поиска Lucene/Solr позволяет вам изменять относительную важность статей в списке результатов поискового запроса. Настройка более высокого (или низкого) веса ранжирования не приведет к тому, что статьи из этого раздела окажутся выше (или ниже) всех остальных статей. Однако, это приведет к тому, что эти статьи будут оказываться в результатах поиска выше (или ниже), чем если бы они оказались без выполнения этой настройки. Установка этого параметра в значение «Никогда не показывать» приведет к полному исключению статей этого раздела из результатов поиска.
uk_ua: Модуль пошуку Lucene/Solr дозволяє вам змінювати відносну важливість (вагу) статей у списку результатів пошукового запиту. Встановлення вищої (або нижчої) ваги ранжування не призведе до того, що статті з цього розділу виявляться вище (або нижче) усіх інших статей. Проте вони матимуть кращий (або гірший) ранг ніж це було б без цих змін. Встановлення для цього параметру значення "ніколи не відображати" призведе до повного виключення статей цього розділу із результатів пошуку.

# plugins.generic.lucene.sectionForm.rankingBoostInvalid
source: Please select a valid custom ranking weight.
ar_iq: لطفاً، إختر وزن تقييم مخصص صحيح.
da_dk: Vælg en gyldig brugerdefineret rangerinsvægtning.
ru_ru: Пожалуйста, введите правильный пользовательский вес ранжирования.
uk_ua: Будь ласка, оберіть правильну власну вагу ранжування.

# plugins.generic.lucene.sectionForm.ranking.never
source: Never Show
ar_iq: لا ترني أبداً
da_dk: Vis aldrig
ru_ru: Никогда не показывать
uk_ua: Ніколи не відображати

# plugins.generic.lucene.sectionForm.ranking.low
source: Rank Lower
ar_iq: قيمه أدنى
da_dk: Rangér lavere
ru_ru: Низкий ранг
uk_ua: Низький ранг

# plugins.generic.lucene.sectionForm.ranking.high
source: Rank Higher
ar_iq: قيمه أعلى
da_dk: Rangér højere
ru_ru: Высокий ранг
uk_ua: Високий ранг

# plugins.generic.lucene.settings.orderBy.relevance
source: Relevance
da_dk: Relevans

# plugins.generic.lucene.settings.orderBy.author
source: Author
da_dk: Forfatter

# plugins.generic.lucene.settings.orderBy.issue
source: Issue
da_dk: Nummer

# plugins.generic.lucene.settings.orderBy.date
source: Publication Date
da_dk: Udgivelsesdato

# plugins.generic.lucene.settings.orderBy.journal
source: Journal Title
da_dk: Tidsskriftstitel

# plugins.generic.lucene.settings.orderBy.article
source: Article Title
da_dk: Artikeltitel

# plugins.generic.lucene.settings.password
source: Password
ar_iq: كلمة المرور
ru_ru: Пароль
uk_ua: Пароль

# plugins.generic.lucene.settings.startStopServer
source: Solr Server Administration
ru_ru: Администрирование сервера Solr
uk_ua: Адміністрування серверу Solr

# plugins.generic.lucene.settings.startServer
source: Start Server
ru_ru: Запустить сервер
uk_ua: Запустити сервер

# plugins.generic.lucene.settings.stopServer
source: Stop Server
ru_ru: Остановить сервер
uk_ua: Зупинити сервер

# plugins.generic.lucene.sectionForm.ranking.normal
source: Normal
ar_iq: إعتيادي
ru_ru: Нормальный
uk_ua: Нормальний

# plugins.generic.lucene.faceting.displayName
source: Lucene Faceting
ar_iq: قالب Lucene

# plugins.generic.lucene.faceting.description
source: Faceting Block Plugin for Lucene
ar_iq: قالب كتلة الإضافة Lucene
