Repository: rissajeanne/lucene
Catalog: locale/*/locale.po
Languages: ar_iq, da_dk, ru_ru, uk_ua

# plugins.generic.lucene.displayName
source: Lucene Search Plugin
ar_iq: إضافة بحث Lucene
da_dk: Lucene søge-plugin
ru_ru: Модуль поиска «Lucene»
uk_ua: Модуль пошуку Lucene

# plugins.generic.lucene.description
source: The Lucene plugin provides multi-language support, improved search result relevance, faster indexing, better scalability and more.
ar_iq: هذه الإضافة تقدم دعماً لتعدد اللغات، تحسن ما يتعلق بنتائج البحث، تسرع الفهرسة، تمكن التوسع بشكل أفضل، والمزيد غير ذلك.
da_dk: Lucene-plugin’en understøtter flersproget søgning, forbedrer søgerelevansen, foretager hurtigere indeksering og giver bedre skalerbarhed mm.
ru_ru: Обеспечивает поддержку нескольких языков, улучшает релевантность результатов поиска, ускоряет индексацию, улучшает масштабирование и так далее.
uk_ua: Модуль Lucene пропонує можливості багатомовного пошуку, покращену релевантність пошукових результатів, швидке індексування, масштабованість ті ін.

# plugins.generic.lucene.faceting.title
source: refine your search
ar_iq: تحسين عمليات البحث
da_dk: forfin din søgning
ru_ru: уточните поисковый запрос
uk_ua: уточніть пошуковий запит

# plugins.generic.lucene.faceting.discipline
source: Discipline
ar_iq: التخصص العلمي
da_dk: Fagområde
ru_ru: Дисциплина
uk_ua: Дисципліна

# plugins.generic.lucene.faceting.subject
source: Keyword
ar_iq: الكلمة المفتاحية
da_dk: Nøgleord
ru_ru: Ключевое слово
uk_ua: Ключове слово

# plugins.generic.lucene.faceting.type
source: Method/Approach
ar_iq: الطريقة/المنهج
da_dk: Metode/Tilgang
ru_ru: Метод/Подход
uk_ua: Метод/Підхід

# plugins.generic.lucene.faceting.coverage
source: Coverage
ar_iq: التغطية
da_dk: Dækning
ru_ru: Охват
uk_ua: Охоплення

# plugins.generic.lucene.faceting.journalTitle
source: Journal
ar_iq: المجلة
da_dk: Tidsskrift
ru_ru: Журнал
uk_ua: Журнал

# plugins.generic.lucene.faceting.authors
source: Author
ar_iq: المؤلف
da_dk: Forfatter
ru_ru: Автор
uk_ua: Автор

# plugins.generic.lucene.faceting.publicationDate
source: Publication Date
ar_iq: تأريخ النشر
da_dk: Udgivelsesdato
ru_ru: Дата публикации
uk_ua: Дата публікації

# plugins.generic.lucene.message.coreNotFound
source: The requested core '{$core}' was not found on the Solr server. Is it online?
ar_iq: لم يتم العثور على ما هو مطلوب: '{$core}' في ملقم المؤسسة العامة. هل هو متصل بالإنترنت حالياً؟
da_dk: Den ønskede kerne '{$core}' blev ikke fundet på Solr-serveren. Er den online?
ru_ru: Запрошенное ядро «{$core}» не было найдено на сервере Solr. Оно подключено?
uk_ua: На сервері Solr не знайдене ядро '{$core}', на яке було зроблено запит. Воно онлайн?

# plugins.generic.lucene.message.indexingIncomplete
source: An error occurred while indexing: Processed {$numProcessed} out of a batch of {$batchCount} ({$numDeleted} deleted documents in this batch).
ar_iq: حدث خطأ ما أثناء الفهرسة: تمت معالجة {$numProcessed} من أصل {$batchCount} ({$numDeleted} وثائق محذوفة من هذه الدفعة).
da_dk: Der opstod en fejl under indeksering: Færdigbehandlet {$numProcessed} ud af en mængde på {$batchCount} ({$numDeleted} slettede dokumenter i denne batch).
ru_ru: Произошла ошибка в процессе индексации: Обработано {$numProcessed} из пакета в {$batchCount} ({$numDeleted} удаленных документов в этом пакете).
uk_ua: Під час індексування сталася помилка: Оброблено {$numProcessed} з пакета в {$batchCount} ({$numDeleted} видалених документів в цьому пакеті).

# plugins.generic.lucene.message.indexOnline
source: Index with {$numDocs} documents online.
ar_iq: فهرسة {$numDocs} وثيقة على الإنترنت.
da_dk: Indeks med {$numDocs} dokumenter online.
ru_ru: Индекс с {$numDocs} документами подключен.
uk_ua: Індекс з {$numDocs} документами підключений.

# plugins.generic.lucene.message.pullIndexingDisabled
source: Pull indexing is not enabled. Please enable it in the Lucene plugin settings.
ar_iq: سحب الفهرسة غير ممكن. لطفاً قم بتمكينها في إعدادات إضافة Lucene.
da_dk: Pull-indeksering er ikke aktiveret. Aktivér det i Lucene-plugin-indstillingerne.
ru_ru: Самостоятельная индексация сервером отключена. Пожалуйста, включите ее в настройках модуля «Lucene».
uk_ua: Індексацію вимкнено. Будь ласка, увімкніть її в налаштуваннях модуля "Lucene".

# plugins.generic.lucene.message.searchServiceOffline
source: Unfortunately the OJS search service is currently offline.
ar_iq: للأسف، إن خدمة البحث لنظام المجلات المفتوحة غير متاحة على الإنترنت حالياً.
da_dk: Beklageligvis er OJS-søgetjenesten i øjeblikket offline.
ru_ru: К сожалению, служба поиска OJS сейчас отключена.
uk_ua: На жаль, пошукова служба OJS зараз не працює.

# plugins.generic.lucene.message.techAdminInformed
source: The technical administrator of this journal has been informed about the problem.
ar_iq: لقد تم إبلاغ المدير التقني للمجلة عن هذه المشكلة.
da_dk: Den tekniske administrator af dette tidsskrift er blevet informeret om problemet.
ru_ru: Технический администратор этого журнала был проинформирован о проблеме.
uk_ua: Технічний адміністратор цього журналу був проінформований про проблему.

# plugins.generic.lucene.message.webServiceError
source: The Lucene web service returned an error.
ar_iq: إن خدمة Lucene على الإنترنت أرجعت خطأً ما.
da_dk: Lucene-webtjenesten returnerede en fejl.
ru_ru: Веб-служба Lucene вернула ошибку.
uk_ua: Веб служба Lucene повернула помилку.

# plugins.generic.lucene.rebuildIndex.couldNotDeleteFieldCache
source: Could not delete the field cache. Please execute 'rm cache/fc-plugins-lucene-fieldCache.php' manually with appropriate permissions.
da_dk: Kunne ikke slette ’field cache’. Udfør 'rm cache/fc-plugins-lucene-fieldCache.php' manuelt under behørig tilladelse.
ru_ru: Не удается удалить кэш полей. Пожалуйста, выполните «rm cache/fc-plugins-lucene-fieldCache.php» вручную с соответствующими правами.
uk_ua: Не вдалося видалити кеш полів. Будь ласка, виконайте 'rm cache/fc-plugins-lucene-fieldCache.php' вручну з відповідними правами доступу.

# plugins.generic.lucene.rebuildIndex.pullResult
source: {$numMarked} articles marked for update
ar_iq: {$numMarked} مقالة مؤشرة للتحديث
da_dk: {$numMarked} artikler markeret til opdatering
ru_ru: {$numMarked} статей помечено для обновления
uk_ua: {$numMarked} статей помічено для оновлення

# plugins.generic.lucene.rebuildIndex.pullWarning
source: Warning: The search index is currently empty because pull indexing is active. You must wait until the SOLR-server pulls the changes or execute the pull.sh and then the load.sh script from the command line.
da_dk: Advarsel: Søgeindekset er i øjeblikket tomt, fordi pull-indekseringen er aktiv. Du skal vente, indtil SOLR-serveren udtrækker ændringerne eller udfører pull.sh og derefter load.sh-scriptet fra kommandolinjen.

# plugins.generic.lucene.rebuildIndex.rebuildDictionaries
source: Rebuilding dictionaries
da_dk: Genopbygning af ordbøger
ru_ru: Перестройка словарей
uk_ua: Перебудова словників

# plugins.generic.lucene.rebuildIndex.updateBoostFile
source: Updating usage statistics data
da_dk: Opdatering af brugsstatistisk-data
ru_ru: Обновление данных статистики использования
uk_ua: Оновлення даних статистики використання

# plugins.generic.lucene.results.didYouMean
source: Did you mean
ar_iq: هل تعني
da_dk: Mente du
ru_ru: Вы имели в виду
uk_ua: Ви мали на увазі

# plugins.generic.lucene.results.orderBy
source: Order results by
ar_iq: رتب النتائج حسب
da_dk: Sorter resultater efter
ru_ru: Упорядочить результат по
uk_ua: Сортувати результати за

# plugins.generic.lucene.results.orderBy.relevance
source: Relevance
ar_iq: ذات صلة
da_dk: Relevans
ru_ru: Релевантности
uk_ua: Релевантністю

# plugins.generic.lucene.results.orderBy.author
source: Author
ar_iq: المؤلف
da_dk: Forfatter
ru_ru: Авторам
uk_ua: Автором

# plugins.generic.lucene.results.orderBy.issue
source: Issue
ar_iq: العدد
da_dk: Nummer
ru_ru: Выпускам
uk_ua: Випуском

# plugins.generic.lucene.results.orderBy.date
source: Publication Date
ar_iq: تأريخ النشر
da_dk: Udgivelsesdato
ru_ru: Дате публикации
uk_ua: Датою публікації

# plugins.generic.lucene.results.orderBy.journal
source: Journal Title
ar_iq: عنوان المجلة
da_dk: Tidsskriftstitel
ru_ru: Названию журнала
uk_ua: Назвою журналу

# plugins.generic.lucene.results.orderBy.article
source: Article Title
ar_iq: عنوان المؤلَّف
da_dk: Artikeltitel
ru_ru: Названию статьи
uk_ua: Назвою статті

# plugins.generic.lucene.results.orderDir.asc
source: Ascending
ar_iq: تصاعدياً
da_dk: Stigende
ru_ru: По возрастанию
uk_ua: Прямий порядок

# plugins.generic.lucene.results.orderDir.desc
source: Descending
ar_iq: تنازلياً
da_dk: Faldende
ru_ru: По убыванию
uk_ua: Зворотній порядок

# plugins.generic.lucene.results.similarDocuments
source: similar documents
ar_iq: وثائق مشابهة
da_dk: tilsvarende dokumenter
ru_ru: похожие документы

# plugins.generic.lucene.results.syntaxInstructions
source: Search tips: <ul> <li>Search terms are case-insensitive</li> <li>Common words are ignored</li> <li>By default articles containing <em>any</em> term in the query are returned (i.e., <em>OR</em> is implied)</li> <li>Make sure that a word exists in an article by prefixing it with <strong>+</strong>; e.g., <em>+journal +access scholarly academic</em></li> <li>Combine multiple words with <em>AND</em> to find articles containing all terms; e.g., <em>education AND research</em></li> <li>Exclude a word by prefixing it with <strong>-</strong> or <em>NOT</em>; e.g., <em>online -politics</em> or <em>online NOT politics</em></li> <li>Search for an exact phrase by putting it in quotes; e.g., <em>"open access publishing"</em>. Hint: Quoting Chinese or Japanese words will help you to find exact word matches in mixed-language fields, e.g. "中国".</li> <li>Use parentheses to create more complex queries; e.g., <em>archive ((journal AND conference) NOT theses)</em></li> </ul>
ar_iq: <h4>تلميحات البحث:</h4><ul> <li>عبارات البحث حساسة للحروف الصغيرة والكبيرة</li> <li>يتم تجاهل الكلمات الشائعة</li> <li>بشكل إفتراضي، المقالات التي تتضمن <em>أي</em> من عبارات البحث ستظهر في النتائج (أي: <em>OR</em> هي المطبقة)</li> <li>لضمان وجود الكلمة في المقالة، إجعلها مسبقة بعلامة <strong>+</strong>؛ مثل: <em>+journal +access scholarly academic</em></li> <li>إجمع عدة كلمات بواسطة <em>AND</em> للعثور على المقالات التي تضمها جميعاً، مثل: <em>education AND research</em></li> <li>استثن كلمة ما عبر سبقها بعلامة <strong>-</strong> أو <em>NOT</em>؛ مثل: <em>online -politics</em> أو <em>online NOT politics</em></li> <li>إبحث عن جملة كاملة كما هي عبر وضعها بين علامات اقتباس؛ مثل: <em>"open access publishing"</em>. ملاحظة: وضع الكلمات الصينية أو اليابانية بين علامات الاقتباس يساعدك في العثور على كلمات مطابقة في حقول متعددة اللغات؛ مثل: "中国".</li> <li>استعمل الأقواس لإنشاء استعلامات بحث أكثر تعقيداً؛ مثل: <em>archive ((journal AND conference) NOT theses)</em></li> </ul>
da_dk: Søgetips: <ul> <li>I søgetermerne skelnes der ikke mellem store og små bogstaver</li> <li>Almene ord ignoreres</li> <li>Som standard returneres artikler, der indeholder <em>ethvert</em> ord, der indgår i søgningen (dvs. <em>ELLER</em> er underforstået)</li> <li>Sørg for at et specifikt ord findes i en artikel ved at sætte et <strong>+</strong> foran; fx + <em>tidsskrift + adgang videnskabelig akademisk</em></li> <li>Kombinér flere ord med <em>OG</ em> for at finde artikler, der indeholder alle udtryk; fx <em>uddannelse og forskning</ em></li> <li>Udeluk et ord ved at sætte et <strong>-</ strong> eller et <em>IKKE</ em> foran; fx <em>online -politik </ em> eller <em>online IKKE politik </ em></li> <li>Søg efter en specifik sætning ved at sætte den i anførselstegn; fx <em>"open access publicering"</ em>. Tip: Når du anvender kinesiske eller japanske ord, kan du finde specifikke ordkombinationer i blandede sprogfelter, f.eks. "??".</li> <li>Brug parentes til at oprette mere komplekse forespørgsler; fx <em>arkiv ((tidsskrift OG konference) IKKE afhandlinger)</ em></li> </ul>
ru_ru: <h4>Советы по поиску:</h4><ul> <li>Поиск производится независимо от регистра (заглавные и строчные буквы не различаются)</li> <li>Общие слова игнорируются</li> <li>По умолчанию, в результатах поиска возвращаются статьи, содержащие <em>любое</em> слово из запроса (то есть, предполагается условие <em>OR</em>)</li> <li>Если слово должно обязательно присутствовать в статье, поставьте в начале знак <strong>+</strong>, например, <em>+журнал +доступ научный академический</em></li> <li>Чтобы найти статьи, содержащие все слова, соединяйте их с помощью <em>AND</em>, например, <em>образование AND исследование</em></li> <li>Чтобы слово не попадало в результаты поиска, поставьте перед ним знак <strong>-</strong> или <em>NOT</em>, например, <em>онлайн -политика</em> или <em>онлайн NOT политика</em></li> <li>Для поиска точной фразы, заключите ее в кавычки, например, <em>"Открытый доступ к изданиям"</em>. Подсказка: заключение в кавычки китайских или японских слов поможет вам найти точное совпадение в полях с несколькими языками, например, "中国".</li> <li>Используйте круглые скобки для построения более сложных запросов, например, <em>архив ((журнал AND конференция) NOT тезисы)</em></li> </ul>
uk_ua: Поради щодо пошуку: <ul> <li>Пошук не чутливий до регістру літер (великі та малі літери не відрізняються)</li> <li>Загальні слова ігноруються</li> <li>Усталено видаються статті, що містять <em>будь-яке</em> слово з запиту (тобто мається на увазі умова <em>АБО</em>)</li> <li>Якщо слово повинно обов'язково бути у статті, поставте на початку знак <strong>+</strong>; наприклад: <em>+журнал +доступ науковий академічний</em></li> <li>Щоб знайти статті, що містять усі слова, об'єднуйте їх за допомогою <em>AND</em>; наприклад: <em>освіта AND дослідження</em></li> <li>Щоб виключити слово з результатів пошуку, поставте перед ним знак <strong>-</strong> або <em>NOT</em>; наприклад: <em>онлайн -політика</em> або <em>онлайн NOT політика</em></li> <li>Для пошуку точної фрази вставте її в лапки; наприклад: <em>"відкритий доступ до публікацій"</em>. Підказка: вставка в лапки китайських або японських слів допоможе вам знайти точні збіги в полях з декількома мовами, наприклад: "中国".</li> <li>Використовуйте круглі дужки для створення складніших запитів; наприклад: <em>архів ((журнал AND конференція) NOT тези)</em></li> </ul>

# plugins.generic.lucene.settings
source: Settings
ar_iq: الإعدادات
da_dk: Indstillinger
ru_ru: Настройки
uk_ua: Налаштування

# plugins.generic.lucene.settings.autosuggest
source: Auto-Suggest (show a dynamic drop-down with search term suggestions while entering a search query)
ar_iq: إقترح آلياً (أظهر قائمة منسدلة متغيرة تعطي مقترحات لكلمات البحث أثناء إدخال استعلام البحث)
da_dk: 'Foreslå automatisk' (Vis en dynamisk drop-down-menu med forslag til søgeord, mens du indtaster en søgeforespørgsel)
ru_ru: Автоподстановка (показывать раскрывающийся список с динамически меняющимися предлагаемыми поисковыми терминами в процессе ввода поискового запроса)
uk_ua: Автопідстановка (показувати спадне меню із пропозиціями пошукових слів, які динамічно змінюються при введенні пошукового запиту)

# plugins.generic.lucene.settings.autosuggestTypeExplanation
source: <strong>Check terms for results</strong>: Only suggest terms that will actually produce search results. Suggestions will be cross-checked against the current journal and terms already entered into other search fields.<br /> <strong>Use global dictionary</strong>: This is faster, consumes less resources on the search server and therefore scales better for large installations. Suggestions may contain irrelevant terms, though, e.g. from other journals or terms that produce no search results.
ar_iq: <strong>تتحقق من التعابير لخدمة النائج</strong>: إقترح فقط التعابير التي تقود فعلياً إلى إيجاد نتائج. المقترحات ستكون مدققة بالتقاطع مع محتويات المجلة الحالية والعبارات المدخلة سابقاً في حقول البحث الأخرى.<br /> <strong>استعمل القاموس العام</strong>: أسرع، يستهلك موارد أقل من ملقم البحث، ولذلك يتوسع بشكل أفضل في الأنظمة الكبيرة. قد تتضمن المقترحات عندها عبارات ليست ذات صلة، مع ذلك، مثل عبارات مستقاة من مجلات أخرى، أو تلك التي قد لا تقود إلى نتائج ملموسة
da_dk: <strong>Kontrollér om ord giver resultater</ strong>: Foreslå kun ord, der rent faktisk vil generere et søgeresultat. Forslag vil være kryds-kontrolleret op imod det aktuelle tidsskrift og ord, der allerede er indtastet i andre søgefelter.<br /> <strong>Brug global ordbog</ strong>: Dette er hurtigere, bruger færre ressourcer på serveren og skaleres derfor bedre I forbindelse med omfattende installationer. Forslag kan imidlertid indeholde irrelevante ord, f.eks. fra andre tidsskrifter eller søgeord, der ikke genererer søgeresultater.
ru_ru: <strong>Проверять термины на результат</strong>: Предлагаются только термины, которые действительно дадут результаты при поиске. Предложения будут перепроверены по текущему журналу и терминам, уже введенным в другие поисковые поля.<br /> <strong>Использовать глобальный словарь</strong>: Этот вариант быстрее, требует меньше ресурсов сервера при поиске и, следовательно, лучше масштабируется на больших инсталляциях. Хотя предложения могут содержать неподходящие термины, то есть термины из других журналов или термины, которые не дают результатов при поиске.
uk_ua: <strong>Перевіряти слова на результат</strong>: Пропонуються лише ті слова, які справді дадуть результат при пошуку. Пропозиції будуть перевірені по поточному журналу та словам уже введеним в інші пошукові поля.<br /> <strong>Використовувати глобальний словник</strong>: Це швидше, потребує менше ресурсів сервера при пошукові, а отже краще маштабується для великих інсталяцій. Але пропозиції можуть містити невідповідні слова, тобто слова з інших журналів або слова, які не дають результатів пошуку.

# plugins.generic.lucene.settings.autosuggestTypeFaceting
source: Check terms for results
ar_iq: تتحقق من التعابير لخدمة النائج
da_dk: Tjek om ord findes i søgeresultat
ru_ru: Проверять термины на результат
uk_ua: Перевіряти слова на результат

# plugins.generic.lucene.settings.autosuggestTypeSuggester
source: Use global dictionary
ar_iq: استعمل القاموس العام
da_dk: Brug global ordbog
ru_ru: Использовать глобальный словарь
uk_ua: Використовувати глобальний словник

# plugins.generic.lucene.settings.customRanking
source: Custom Ranking (set individual ranking weights per journal section)
ar_iq: تقييم مخصص (ضع أوزان تقييم مستقلة لكل قسم في المجلة)
da_dk: Brugerdefineret rangering (indstil individuelle rangerings-markeringer ud for hver tidsskriftssektion)
ru_ru: Пользовательское ранжирование (установить индивидуальные веса ранжирования для разделов журнала)
uk_ua: Власне ранжування (встановіть індивідуальні оцінки в кожному розділі журналу)

# plugins.generic.lucene.settings.description
source: The Lucene plugin acesses the Lucene search index through a Solr server. This configuration page allows you to configure access to the Solr server. <strong>Please make sure you read the plugin's README file (plugins/generic/lucene/README) before you try to change the default configuration.</strong> If you are using the embedded scenario behind a firewall as explained in the README file then you may probably leave all configuration parameters unchanged.
ar_iq: إن إضافة البحث Lucene تصل إلى فهرس البحث Lucene عبر ملقم المؤسسة. صفحة الإعداد هذه تتيح لك ضبط الوصول إلى ذلك الملقم. <strong>لطفاً، تأكد من أنك قرأت ملف الإضافة README (plugins/generic/lucene/README) قبل أن تقوم بتغيير الإعدادات الإفتراضية لها.</strong> إن كنت تستعمل طريقة التضمين خلف جدار الحماية كما هي مذكورة في ملف README، عندها قد يكون من الأفضل لك ترك كل الإعدادات الإفتراضية على حالها.
da_dk: Lucene-plugin’en bruger Lucene-søgeindekset via en Solr-server. Denne konfigurationsside giver dig mulighed for at konfigurere adgang til Solr-serveren. <strong>Sørg for at du læser plugin’ens README-fil (plugins/generic/lucene/README), før du forsøger at ændre standardkonfigurationen.</strong> Hvis du bruger det integrerede scenarie bag en firewall som forklaret i README-filen, kan du formentlig efterlade alle konfigurationsparametre uændret.
ru_ru: Модуль «Lucene» получает доступ к индексу поиска Lucene через сервер Solr. Эта страница конфигурации позволяет вам настроить доступ к серверу Solr. <strong>Пожалуйста убедитесь, что вы прочитали файл README модуля (plugins/generic/lucene/README) до того, как попытаетесь изменить конфигурацию по умолчанию.</strong> Если вы используете сценарий встраивания, находясь за брандмауэром, как описано в файле README, то возможно вам стоит оставить все параметры настройки без изменений.
uk_ua: <p> Модуль Lucene отримує доступ до пошукового індексу Lucene через сервер Solr. Ця сторінка дозволяє Вам налаштувати доступ до серверу Solr.</p> <p><strong>Будь ласка, перед тим, як намагатись змінювати стандартну конфігурацію, прочитайте файл README модуля (plugins/generic/lucene/README).</strong></p> <p>Якщо Ви використовуєте вбудований сценарій брендмауера, як вказано у файлі README, тоді, напевно, Ви можете залишити всі налаштування незмінними.</p>

# plugins.generic.lucene.settings.dictionaryRebuild
source: Rebuild dictionaries
da_dk: Genopbyg ordbøger
ru_ru: Перестроить словари
uk_ua: Перебудувати словники

# plugins.generic.lucene.settings.faceting
source: Faceting (display a navigation box with additional filters to refine your search)
ar_iq: القولبة (إعرض صندوق تنقل مع تصفيات إضافية لتحسين نتائج البحث)
da_dk: Facettering (vis en navigationsboks med ekstra filtre til optimering af din søgning)
ru_ru: Фасетизация (отобразить блок навигации с дополнительными фильтрами для уточнения вашего поиска)
uk_ua: Фасетування (відображення вікна навігації з додатковими фільтрами для точного пошуку)

# plugins.generic.lucene.settings.facetingSelectCategory
source: You may select specific facet categories (the corresponding metadata must have beeen selected for indexing in journal setup, step 3.4)
ar_iq: بإمكانك اختيار فئات قولبة محددة (البيانات الوصفية ذات الصلة ينبغي أن تكون منتخبة للفهرسة عند الخطوة 3.4 من تهيئة المجلة)
da_dk: Du kan vælge bestemte facetkategorier (den tilsvarende metadata skal være tilvalgt under indeksering i tidsskriftsopsætning, trin 3.4). (I OJS 3 gælder det Indstillinger > Workflow > Manuskriptmetadata)
ru_ru: Вы можете выбрать конкретные категории фасетов (соответствующие метаданные должны быть выбраны для индексирования на шаге 3.4 установки журнала)
uk_ua: Ви можете вибрати певні категорії фасетів (відповідні метадані повинні бути вибрані для індексації під час кроку 3.4 встановлення журналу)

# plugins.generic.lucene.settings.featureDescription
source: The Lucene plugin provides several optional search features. Most of these features are enabled by default but can be disabled or fine-tuned.
ar_iq: إن إضافة البحث Lucene تقدم ميزات بحث إختيارية متعددة. معظم هذه الميزات ممكن إفتراضياً، لكن بالإمكان تعطيلها أو تحسين ضبطها لاحقاً.
da_dk: Lucene-plugin'en indeholder flere valgfrie søgefunktioner. De fleste af disse funktioner er aktiveret som standard, men kan deaktiveres eller finjusteres.
ru_ru: Модуль «Lucene» предоставляет несколько дополнительных возможностей для поиска. Большинство из этих возможностей включены по умолчанию, но могут быть отключены или иначе настроены.
uk_ua: Модуль "Lucene" надає декілька додаткових можливостей для пошуку. Більшість цих можливостей усталено увімкнені, але їх можна вимкнути або переналаштовані.

# plugins.generic.lucene.settings.highlighting
source: Highlighting (display a short excerpt of each article's full text containing queried keywords)
ar_iq: تسليط الضوء (يعرض مقتطفات قصيرة من النص الكامل لكل مقالة تتضمن الكلمات المستعلم عنها)
da_dk: Fremhævelse (vis et kort uddrag af hver artikels fulde tekst, der indeholder søgeordene)
ru_ru: Выделение (показывать небольшой фрагмент полного текста каждой статьи, содержащий ключевые слова из поискового запроса)
uk_ua: Виділення (показати короткий уривок із повного тексту кожної статті, котра містить слова з пошукового запиту)
